{
  "basics": {
    "name": "Sultan Gillani",
    "label": "Senior Site Reliability Engineer",
    "picture": "me.png",
    "email": "sultangillani77@gmail.com",
    "phone": "(678) 842-3058",
    "website": "https://sultangillani.com",
    "summary": "Sultan has around 10 years of experience in IT, Python Development, Cloud computing such as Amazon Web Services (AWS), Google Cloud Platform, Microsoft Azure in DevOps through CI, CD tools like Jenkins, Gitlab CI, GitHub Actions, and Azure Devops. He implemented DevOps practices in organizations to reduce the gap from development to production releases. He has experience on working with Agile Scrum methodologies. He has experience in setting up databases in GCP/Azure/AWS regardless of database type. He has hands on Experience in using configuration management tools like Vagrant, Ansible, & Packer. He has experience in working with Version control systems like git, mercurial, & svn. He has experience in Jenkins, Gitlab CI, and GitHub Actions to perform Nightly builds, Milestone builds and Continuous Integration. He maintained a highly available VMware vSphere servers: i.e. vCenter, ESX, vSAN and NSX, including maintenance and reconfiguration. He implemented Docker based Continuous Integration and Deployment Framework. He has written docker files and created docker images to deploy applications into docker containers. He has installed, configured, modified, tested, and deployed applications on Apache Webservers, Nginx and IIS. He has been involved in Shell scripts for compilation and deployment processes and automations.",
    "location": {
      "address": "",
      "postalCode": "GA 30309",
      "city": "Atlanta",
      "countryCode": "US",
      "region": "Georgia"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "sultansgillani",
        "url": ""
      },
      {
        "network": "GitHub",
        "username": "sultansgillani",
        "url": "https://github.com/sultansgillani"
      },
      {
        "network": "GitLab",
        "username": "sultangillani",
        "url": "https://gitlab.com/sultangillani"
      }
    ]
  },
  "work": [
    {
      "company": "Nolan Transportation Group",
      "position": "Site Reliability Engineer",
      "website": "https://ntgfreight.com",
      "startDate": "2019-12-09",
      "summary": "",
      "highlights": [
        "Integral part of a reorganization that moved from on-premises operations-based infrastructure to Google Cloud Platform.",
        "Worked with development and operations to move our complete operational cloud experience from GCP to Azure based on management initiatives.",
        "Lead the process of moving the full codebase of our application/s from Azure Devops (Team Foundation Services), to Gitlab, and in turn taught all employees, current, and past, to utilize the modern standard of using git.",
        "Maintained and expanded upon Infrastructure as code by utilizing Terraform for Infrastructure, and Gitlab CI/Ansible for configuration management and deployment.",
        "Managed and configured the companies full stack of DevOps tools such as Gitlab CI, PowerShell, Bash Scripts, etc., and created various Docker images, and terraform workspaces.",
        "Created and implemented the initiative of utilizing configuration and infrastructure as code instead of the past error-prone, insecure strategy of manual deployments/configurations.",
        "Worked extensively in package management and created multiple npm and nuget private packages in Gitlab.",
        "Performed front-end development for the React/Redux and Angular based logistics microservice UI’s.",
        "Performed back-end development for the C# based logistics microservices, utilizing object-oriented programming.",
        "Worked with the QA team on utilizing their testing platform of Katalon to integrate their manual testing strategy, to automated testing utilizing Gitlab CI.",
        "Worked with the security team to enact static and dynamic code analysis for all projects utilizing the fortify on demand platform. This reduced security bugs in our code base by 85%.",
        "Added/Configured all current and new applications/microservices to utilize apm monitoring with New Relic.",
        "Added infrastructure monitoring for all cloud infrastructure including virtual machines, and Kubernetes environments for New Relic."
      ]
    },
    {
      "company": "Veracity Industrial Networks",
      "position": "DevOps Engineer",
      "website": "https://veracity.io",
      "startDate": "2018-11-28",
      "summary": "",
      "highlights": [
        "Maintain the product demo tool that allows potential customers to easily test-drive a full version of the security appliance product via an AWS based instance.",
        "Provide leadership in DevOps, Infrastructure-as-code, and CI/CD methodologies and techniques including configuration management, change control and full repeatability.",
        "Managed and Configured the companies full stack of DevOps tools such as Jenkins, GitHub, AWS, & Ansible, and created various Docker images, and ansible playbooks.",
        "Converted a fully managed Jenkins master instance from a pure freestyle implementation to Jenkins pipelines, utilizing declarative pipeline syntax for all production repositories.",
        "Created new jenkins infrastructure to utilize multiple jenkins nodes, ensuring a high available Jenkins cluster.",
        "Created the companies first Jenkins Shared Library to consolidate pipeline code and simplify the build and deployment process, utilizing the groovy programming language.",
        "Converted the OpenBSD production environment to linux to be able to utilize newly available devops tooling and configuration.",
        "Maintained highly available VMware vSphere servers: i.e. vCenter, ESX, vSAN and NSX, including maintenance and reconfiguration.",
        "Worked extensively in package management and created custom OpenBSD ports packages for production environments.",
        "Performed front-end development for the React/Redux based security appliance UI.",
        "Performed back-end development for the Ruby/Sinatra based security appliance, utilizing object oriented programming.",
        "Helped maintain and use RSpec/Capybara based software testing suite to validate UI correctness.",
        ""
      ]
    },
    {
      "company": "Yardi Systems Inc.",
      "position": "DevOps Engineer",
      "website": "",
      "startDate": "2014-01-06",
      "endDate": "2018-10-15",
      "summary": "",
      "highlights": [
        "Used proactive approach to ensure 99.99% availability of production environment on hybrid infrastructure environment.",
        "Configured and Maintained DevOps tools like Jenkins, GitHub, TeamCity, & Ansible Created various configuration files.",
        "Understanding of cloud web hosting infrastructure architectures which utilize relational & NoSQL (Mongo DB) databases. ",
        "Worked extensively on containerized nginx reverse proxy servers along with dynamic config provisioning for newly created containers and on dynamic provisioning of LetsEncrypt certificates for custom URLs. Parsing, Indexing, Searching - Hot, Warm, Cold, Frozen bucketing.",
        ""
      ]
    },
    {
      "company": "Sapna Group of Hotels",
      "position": "IT Engineer - DevOps",
      "website": "",
      "startDate": "2011-08-01",
      "endDate": "2014-12-01",
      "summary": "",
      "highlights": [
        "Worked on an internal customized application deployment project. Setup AWS Services utilizing S3, and EC2. ",
        "Worked on web service API to get the data from webservers to on-premise SQL data base servers. ",
        "Created Python scripts for steady and continuous deployment, and integration. ",
        "Participated in project planning sessions with business analyst and team members to analyze client requirement. Created a zero-downtime environment, even during deployments, for the API services and greatly increased the flexibility of the system. ",
        "Debug and maintain all Jenkins jobs and their deployment servers. ",
        "Tuned SQL Statements using views and Stored Procedure. Designed Database objects including tables, procedures, views and database triggers on SQL Server Databases."
      ]
    }
  ],
  "volunteer": [],
  "education": [],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Cloud Technologies: AWS, GCP, Kubernetes, Azure",
      "level": "Intermediate",
      "keywords": [
        "AWS",
        "Kubernetes",
        "GCP",
        "Azure"
      ]
    },
    {
      "name": "Programming Languages: Python, Ruby, C#, VB.NET",
      "level": "Intermediate",
      "keywords": [
        "Python",
        "Ruby",
        "C#",
        "VB.NET"
      ]
    },
    {
      "name": "Configuration Management: Ansible, Vagrant, Consul, Packer",
      "level": "Expert",
      "keywords": [
        "Configuration Management",
        "Ansible",
        "Vagrant",
        "Consul",
        "Packer"
      ]
    },
    {
      "name": "Scripting Language: UNIX Shell Scripting(bash, sh, zsh), Groovy, & Python",
      "level": "Intermediate",
      "keywords": [
        "Python Scripting",
        "Shell Scripting",
        "Groovy Scripting"
      ]
    },
    {
      "name": "Database & Visualization: PostgreSQL, SQL Server, MySQL, & SQLite",
      "level": "Expert",
      "keywords": [
        "Databases",
        "Postgresql",
        "MySQL",
        "SQL Server",
        "SQLite"
      ]
    },
    {
      "name": "Network Technologies: NAT, VPC, Subnet Groups, TCP, UDP, MultiCast, Route Tables, CDNs, Firewalls",
      "level": "Expert",
      "keywords": [
        "Networking",
        "Firewalls",
        "NAT"
      ]
    },
    {
      "name": "Web Server: Nginx, Apache, IIS",
      "level": "Expert",
      "keywords": [
        "Nginx",
        "Ingress",
        "Apache",
        "Load Balancer",
        "IIS"
      ]
    },
    {
      "name": "Version Control System: Git, Subversion, Mercurial",
      "level": "Expert",
      "keywords": [
        "Git",
        "VCS",
        "SVN",
        "HG"
      ]
    },
    {
      "name": "Monitoring Tools: New Relic, Prometheus, Grafana, Dynatrace.",
      "level": "Intermediate",
      "keywords": [
        "Monitoring",
        "New Relic",
        "Prometheus",
        "Grafana",
        "Dynatrace"
      ]
    },
    {
      "name": "CI/CD, Automation Tools: Jenkins, Gitlab CI, Team City, Azure Devops, & Travis CI.",
      "level": "Expert",
      "keywords": [
        "Automation",
        "CI/CD",
        "Jenkins",
        "Gitlab",
        "Pipelines",
        "Github",
        "Azure Devops"
      ]
    },
    {
      "name": "Platforms: Linux, Windows, OSX, OpenBSD/Unix",
      "level": "Expert",
      "keywords": [
        "Linux",
        "OSX",
        "Debian",
        "Ubuntu",
        "Centos",
        "OpenBSD"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "references": []
}
